#include <stdio.h>

const wchar_t *L_NiHao = LR"(你好，世界！)";
const char *Cn_Hello = R"(你好，世界！)";
const char *En_Hello = R"(Hello World!)";
const char *title_card_2048 = R"(
   /\\\\\\\\\          /\\\\\\\                /\\\         /\\\\\\\\\
  /\\\///////\\\      /\\\/////\\\            /\\\\\       /\\\///////\\\
  \///      \//\\\    /\\\    \//\\\         /\\\/\\\      \/\\\     \/\\\
             /\\\/    \/\\\     \/\\\       /\\\/\/\\\      \///\\\\\\\\\/
           /\\\//      \/\\\     \/\\\     /\\\/  \/\\\       /\\\///////\\\
         /\\\//         \/\\\     \/\\\   /\\\\\\\\\\\\\\\\   /\\\      \//\\\
        /\\\/            \//\\\    /\\\   \///////////\\\//   \//\\\      /\\\
        /\\\\\\\\\\\\\\\   \///\\\\\\\/              \/\\\      \///\\\\\\\\\/
        \///////////////      \///////                \///         \/////////
)";

int main()
{
    wprintf(L"%s\n", L_NiHao);
    printf("%s\n", Cn_Hello);
    printf("%s\n", En_Hello);
    printf("%s\n", title_card_2048);

    int L = 1;
    int R = 100;
    int LR = L + R;
    printf("%d + %d = %d\n", L, R, LR);

    return 0;
}
